load/data/log_2025-02-07_08:53:01_700_ethz.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ethz.js
        output: csv (data/data_2025-02-07_08:53:01_700_ethz.csv)

     scenarios: (100.00%) 1 scenario, 700 max VUs, 1m0s max duration (incl. graceful stop):
              * ethz: 700 looping VUs for 30s (exec: run, gracefulStop: 30s)


running (0m00.9s), 700/700 VUs, 67 complete and 0 interrupted iterations
ethz   [   3% ] 700 VUs  00.9s/30s

running (0m01.9s), 700/700 VUs, 487 complete and 0 interrupted iterations
ethz   [   6% ] 700 VUs  01.9s/30s

running (0m02.9s), 700/700 VUs, 1366 complete and 0 interrupted iterations
ethz   [  10% ] 700 VUs  02.9s/30s

running (0m03.9s), 700/700 VUs, 2272 complete and 0 interrupted iterations
ethz   [  13% ] 700 VUs  03.9s/30s

running (0m04.9s), 700/700 VUs, 3163 complete and 0 interrupted iterations
ethz   [  16% ] 700 VUs  04.9s/30s

running (0m05.9s), 700/700 VUs, 4295 complete and 0 interrupted iterations
ethz   [  20% ] 700 VUs  05.9s/30s

running (0m06.9s), 700/700 VUs, 5937 complete and 0 interrupted iterations
ethz   [  23% ] 700 VUs  06.9s/30s

running (0m07.9s), 700/700 VUs, 7545 complete and 0 interrupted iterations
ethz   [  26% ] 700 VUs  07.9s/30s

running (0m08.9s), 700/700 VUs, 9134 complete and 0 interrupted iterations
ethz   [  30% ] 700 VUs  08.9s/30s

running (0m09.9s), 700/700 VUs, 10780 complete and 0 interrupted iterations
ethz   [  33% ] 700 VUs  09.9s/30s

running (0m10.9s), 700/700 VUs, 12402 complete and 0 interrupted iterations
ethz   [  36% ] 700 VUs  10.9s/30s

running (0m11.9s), 700/700 VUs, 13893 complete and 0 interrupted iterations
ethz   [  40% ] 700 VUs  11.9s/30s

running (0m12.9s), 700/700 VUs, 15503 complete and 0 interrupted iterations
ethz   [  43% ] 700 VUs  12.9s/30s

running (0m13.9s), 700/700 VUs, 17161 complete and 0 interrupted iterations
ethz   [  46% ] 700 VUs  13.9s/30s

running (0m14.9s), 700/700 VUs, 18756 complete and 0 interrupted iterations
ethz   [  50% ] 700 VUs  14.9s/30s

running (0m15.9s), 700/700 VUs, 20396 complete and 0 interrupted iterations
ethz   [  53% ] 700 VUs  15.9s/30s

running (0m16.9s), 700/700 VUs, 22007 complete and 0 interrupted iterations
ethz   [  56% ] 700 VUs  16.9s/30s

running (0m17.9s), 700/700 VUs, 23648 complete and 0 interrupted iterations
ethz   [  60% ] 700 VUs  17.9s/30s

running (0m18.9s), 700/700 VUs, 25218 complete and 0 interrupted iterations
ethz   [  63% ] 700 VUs  18.9s/30s

running (0m19.9s), 700/700 VUs, 26854 complete and 0 interrupted iterations
ethz   [  66% ] 700 VUs  19.9s/30s

running (0m20.9s), 700/700 VUs, 28495 complete and 0 interrupted iterations
ethz   [  70% ] 700 VUs  20.9s/30s

running (0m21.9s), 700/700 VUs, 30120 complete and 0 interrupted iterations
ethz   [  73% ] 700 VUs  21.9s/30s

running (0m22.9s), 700/700 VUs, 31747 complete and 0 interrupted iterations
ethz   [  76% ] 700 VUs  22.9s/30s

running (0m23.9s), 700/700 VUs, 33356 complete and 0 interrupted iterations
ethz   [  80% ] 700 VUs  23.9s/30s

running (0m24.9s), 700/700 VUs, 34887 complete and 0 interrupted iterations
ethz   [  83% ] 700 VUs  24.9s/30s

running (0m25.9s), 700/700 VUs, 36545 complete and 0 interrupted iterations
ethz   [  86% ] 700 VUs  25.9s/30s

running (0m26.9s), 700/700 VUs, 38126 complete and 0 interrupted iterations
ethz   [  90% ] 700 VUs  26.9s/30s

running (0m27.9s), 700/700 VUs, 39825 complete and 0 interrupted iterations
ethz   [  93% ] 700 VUs  27.9s/30s

running (0m28.9s), 700/700 VUs, 41393 complete and 0 interrupted iterations
ethz   [  96% ] 700 VUs  28.9s/30s

running (0m29.9s), 700/700 VUs, 43106 complete and 0 interrupted iterations
ethz   [ 100% ] 700 VUs  29.9s/30s

     ✗ is status 200
      ↳  99% — ✓ 43849 / ✗ 95

     checks.........................: 99.78% 43849 out of 43944
     data_received..................: 3.0 GB 98 MB/s
     data_sent......................: 6.1 MB 200 kB/s
     http_req_blocked...............: avg=26.56ms  min=0s      med=3.14µs   max=5.37s    p(90)=4.49µs   p(95)=16.1µs  
     http_req_connecting............: avg=666.06µs min=0s      med=0s       max=66.76ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=468.54ms min=0s      med=421.89ms max=6.73s    p(90)=903.36ms p(95)=1.02s   
       { expected_response:true }...: avg=469.56ms min=20.54ms med=423.42ms max=6.73s    p(90)=903.74ms p(95)=1.02s   
     http_req_failed................: 0.21%  95 out of 43944
     http_req_receiving.............: avg=324.34ms min=0s      med=287.94ms max=2.11s    p(90)=730.54ms p(95)=833.02ms
     http_req_sending...............: avg=25.01ms  min=0s      med=7.41µs   max=5.24s    p(90)=22.8µs   p(95)=42.79µs 
     http_req_tls_handshaking.......: avg=1.08ms   min=0s      med=0s       max=183.19ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=119.18ms min=0s      med=108.67ms max=1.65s    p(90)=177.12ms p(95)=207.96ms
     http_reqs......................: 43944  1444.01413/s
     iteration_duration.............: avg=481.36ms min=20.64ms med=425.14ms max=6.83s    p(90)=907.44ms p(95)=1.03s   
     iterations.....................: 43944  1444.01413/s
     vus............................: 700    min=700            max=700
     vus_max........................: 700    min=700            max=700


running (0m30.4s), 000/700 VUs, 43944 complete and 0 interrupted iterations
ethz ✓ [ 100% ] 700 VUs  30s